; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared0 - mode
	spectrograph2 - mode
	thermograph1 - mode
	thermograph3 - mode
	image4 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star8 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image4)
	(supports instrument0 infrared0)
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
)
(:goal (and
	(have_image Star10 spectrograph2)
	(have_image Planet11 spectrograph2)
	(have_image Phenomenon12 thermograph1)
	(have_image Phenomenon13 image4)
	(have_image Star14 thermograph3)
	(have_image Planet15 image4)
	(have_image Planet16 thermograph3)
))

)

; plan
1. (turn_to satellite0 star4 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star4)
   goals met: 0 of 7
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite0 star14 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star14)
   goals met: 0 of 7
5. (take_image satellite0 star14 instrument1 thermograph3)
   added: (have_image star14 thermograph3)
   goals met: 1 of 7
6. (turn_to satellite0 planet16 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 planet16)
   goals met: 1 of 7
7. (take_image satellite0 planet16 instrument1 thermograph3)
   added: (have_image planet16 thermograph3)
   goals met: 2 of 7
8. (turn_to satellite0 groundstation1 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 7
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 7
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
11. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 2 of 7
12. (turn_to satellite0 phenomenon12 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 7
13. (take_image satellite0 phenomenon12 instrument0 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 3 of 7
14. (turn_to satellite0 phenomenon13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 7
15. (take_image satellite0 phenomenon13 instrument0 image4)
   added: (have_image phenomenon13 image4)
   goals met: 4 of 7
16. (turn_to satellite0 planet11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet11)
   goals met: 4 of 7
17. (take_image satellite0 planet11 instrument0 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 5 of 7
18. (turn_to satellite0 planet15 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet15)
   goals met: 5 of 7
19. (take_image satellite0 planet15 instrument0 image4)
   added: (have_image planet15 image4)
   goals met: 6 of 7
20. (turn_to satellite0 star10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star10)
   goals met: 6 of 7
21. (take_image satellite0 star10 instrument0 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 7 of 7
